export const VALIDATION_MESSAGES = {
  ER001: '「{0}」を入力してください',
  ER002: '「{0}」を入力してください',
  ER003: '「{0}」は既に存在しています。',
  ER004: '「{0}」は存在していません。',
  ER005: '「{0}」を{1}形式で入力してください',
  ER006: '{1}桁以内の「{0}」を入力してください',
  ER007: '「{0}」を{1}＜＝桁数、＜＝{2}桁で入力してください',
  ER008: '「{0}」に半角英数を入力してください',
  ER009: '「{0}」をカタカナで入力してください',
  ER010: '「{0}」をひらがなで入力してください',
  ER011: '「{0}」は無効になっています。',
  ER012: '「失効日」は「資格交付日」より未来の日で入力してください。',
  ER013: '該当するユーザは存在していません。',
  ER014: '該当するユーザは存在していません。',
  ER015: 'システムエラーが発生しました。',
  ER016: '「アカウント名」または「パスワード」は不正です。',
  ER017: '「パスワード（確認）」が不正です。',
  ER018: '「{0}」は半角で入力してください。',
  ER019: '[アカウント名]は(a-z, A-Z, 0-9 と _)の桁のみです。最初の桁は数字ではない。',
  ER020: '管理者ユーザを削除することはできません。',
  ER021: 'ソートは (ASC, DESC) でなければなりません。',
  ER022: 'ページが見つかりません。',
  ER023: 'システムエラーが発生しました。',

  MSG001: 'ユーザの登録が完了しました。',
  MSG002: 'ユーザの更新が完了しました。',
  MSG003: 'ユーザの削除が完了しました。',
  MSG004: '削除しますが、よろしいでしょうか。',
  MSG005: '検索条件に該当するユーザが見つかりません。',
} as const;

export type ValidationMessageCode = keyof typeof VALIDATION_MESSAGES;

export function formatValidationMessage(
  code: ValidationMessageCode,
  ...params: string[]
) {
  return params.reduce(
    (message, param, index) => message.replace(`{${index}}`, param),
    VALIDATION_MESSAGES[code]
  );
}
